In [5]:
import numpy as np
import pandas as pd

file_path = "data_with_nan.csv"

df = pd.read_csv(file_path)

In [2]:
df

    col1  col2 col3
0  test1  13.0  NaN
1  test2  44.0  aaa
2  test3   NaN  NaN
3    NaN   NaN  NaN
4  test5   NaN  bbb
5    NaN   NaN  NaN

In [3]:
type(None)

NoneType

In [4]:
df["col2"][5]

np.float64(nan)

In [6]:
np.nan

nan

In [7]:
df["col2"].mean()

np.float64(28.5)

In [8]:
df["col2"].fillna(0)

0    13.0
1    44.0
2     0.0
3     0.0
4     0.0
5     0.0
Name: col2, dtype: float64

In [10]:
df["col2"].fillna(df["col2"].mean())

0    13.0
1    44.0
2    28.5
3    28.5
4    28.5
5    28.5
Name: col2, dtype: float64

In [11]:
df

    col1  col2 col3
0  test1  13.0  NaN
1  test2  44.0  aaa
2  test3   NaN  NaN
3    NaN   NaN  NaN
4  test5   NaN  bbb
5    NaN   NaN  NaN

In [12]:
df["col1"].ffill()

0    test1
1    test2
2    test3
3    test3
4    test5
5    test5
Name: col1, dtype: object

In [13]:
df["col1"].bfill()

0    test1
1    test2
2    test3
3    test5
4    test5
5      NaN
Name: col1, dtype: object

In [14]:
df

    col1  col2 col3
0  test1  13.0  NaN
1  test2  44.0  aaa
2  test3   NaN  NaN
3    NaN   NaN  NaN
4  test5   NaN  bbb
5    NaN   NaN  NaN

In [15]:
df.dropna()

    col1  col2 col3
1  test2  44.0  aaa

In [16]:
df.dropna(thresh=2)

    col1  col2 col3
0  test1  13.0  NaN
1  test2  44.0  aaa
4  test5   NaN  bbb

In [17]:
df["col1"].isna()

0    False
1    False
2    False
3     True
4    False
5     True
Name: col1, dtype: bool

In [18]:
df[df["col1"].isna()]

  col1  col2 col3
3  NaN   NaN  NaN
5  NaN   NaN  NaN

In [19]:
df["col1"].notna()

0     True
1     True
2     True
3    False
4     True
5    False
Name: col1, dtype: bool

In [20]:
df[df["col1"].notna()]

    col1  col2 col3
0  test1  13.0  NaN
1  test2  44.0  aaa
2  test3   NaN  NaN
4  test5   NaN  bbb

In [21]:
df.dropna(how="all")

    col1  col2 col3
0  test1  13.0  NaN
1  test2  44.0  aaa
2  test3   NaN  NaN
4  test5   NaN  bbb